### 1.벡터


#빈벡터만들기
#빈벡터 채우기
#벡터 요소를 다른 요소로 바꾸기

# :연산자와 ()우선순위

#원하는 숫자 부터 일정하게 증가하는 벡터 함수-2가지 세부사항

#반복함수 121212or 111222 두가지

#원하는 모집단에서 원하는 수 만큼 랜덤하게 뽑는 함수+중복해서 뽑기와 각 요소별 확률설정

#indexing
x <- 1:10*2
# 3부터6번째 까지 원소 가져오기
# 1,7,2,4,5,2번째 원소 가져오기
# 2,4,5번째 빼고 나머지 가져오기
# x가 전부 10이상이여야 T반환하는 함수
# x중 하나라도 10이상이어야 T반환하는 함수
# x>10하면 어떤식으로 출력될까?
# sum(x>10)하면 어떤값이 나오며 그 이유는?
# x의 10보다 작은 요소들만 가져오기
# x에서 4인경우만 가져오기+ x에서 4가 아닌애들만 가져오기
# 몫과 나머지 연산자
#x들중 4로 나웠을때 몫이 2인것만 가져옴+ x들 중 4로 나웠을 때 나머지가 0인것만
y <- 101:110
# x를 이용해 y의 106~110까지 뽑기
# 1에서 5000중 26으로 나누어 떨어지는 애들의 갯수는?-두가지 방법
a <- c(TRUE,TRUE,FALSE)
b <- c(TRUE,FALSE,FALSE)
# and or 연산자와 위 a,b에 적용시켰을때 결과
# x에서 4거나 10보다 큰것 둘다동시에 뽑기
# x중 2,4,6,14,16,20만 뽑기-1.조건문3개사용해서 2.인덱싱의 인덱싱 사용해서
# x에서 10 이상의 값들을 전부 30으로 만듬

# 해당 집단 중 컨디션에 만족하는 요소들 위치 알려주는 함수
# y <- 1:5000에서 1025로 나누어서 47이 남는 세번째 숫자 위치와 그 값은?

#NA와 NULL의 차이
a <- c(20,NA,13,24,309)
b <-c(20,NULL,13,24,309)
# a,b 평균 내는 법

# a벡터안에 b벡터가 있는지 확인하는 함수와 NA대신 0으로 출력하는 방법
a <- c(1,2,3,4,5)
b <- c(2,5,7,8,9)
# a벡터에서 b안에 있는 요소들과 일치하는 것들만 뽑아냄
a <- c('b','a','d','k')
b <- c('b','d','f','a')

#벡터 이름짓기
#지은 이름으로 인덱싱하기

#벡터 가로로 묶기, 세로로 묶기




### 2.행렬=벡터들을 모아놓은것, 꼭 같은 길이의 벡터들이어야함


# 행렬 크기 측정하는 함수

# r,cbind외의 행렬 만드는 함수-행과 열 하나씩만 설정해서
# 입력된 자료를 행or열방향? 그렇다면 그 반대로 하기 위해서 쓰는 옵션은?

#행렬 indexing
x <- matrix(1:10*2,nrow=5)
# 2행 2열
# 2번째 열의 모든 행
# 2번째 행의 모든 열
# 2,3,5번째 행의 2번째 열
#차원축소기능 끄기
# 필터링->T,F사용하여 행의1,2,5와+1열값들 가져오기
# 2열 15보다 큰 조건에 해당하는 1열 가져오기
# 1열 5보다 크거나 같은 조건에 해당하는 2열 원소 가져오기

#행렬 데이터를 색정보로 전환하는 패키지는?
#랜덤 숫자 함수-개수,최소,최대 지정하여
#랜덤 고정시키는 함수
#랜덤 숫자 100개로 10*10행렬 만들어 헥스코드로 변환 후 이미지로 전환+조정 없애기

#mat.rds읽어오기->간략하게 보는 함수->최솟값->최댓값->범위 함수
#mat 조정후 이미지로->가로반->세로반->색반전->행렬 뒤집기 함수로 뒤집기

#행렬의 성질, 특성 보는 함수

#행렬의 곱셈과 특징
x <- matrix(1:10*2,ncol=2); y <- matrix(1:4,nrow=2)

#행렬의 원소별 곱셈과 나머지 사칙연산과 특징, recycling의 특징
y <- matrix(1:4,nrow=2) ;z <- matrix(10:13,ncol=2)
# y 역행렬 구하는 함수와 특징, 역행렬이 없는 경우를 뭐라하는지

#행,열 이름붙이기
# 이름으로 인덱싱

#배열 만들기 함수-밑의 mat1과 mat2로 2행 3열 2레이어 만들기
mat1 <- matrix(1:6,nrow=2) ;mat2 <- matrix(7:12,nrow=2)
#모든 행,열 but 첫번째 레이어만->첫번째 array의 1-2행과 1-2열만 가져오기
#배열 뒤집기 함수->2행2열3레이어로 변환하기

# jelly.png파일 읽어오기
#구조 확인하고 의미가 무었인지->색 이미지로 변환->파란색만 없애기

#행렬에 함수 적용시키는 함수
a <- matrix(1:12,ncol=4) #에 대해 각 행별 최대값, 각 열별 최대값 각각구하기
#배열에도 적용 가능
arr <- array(1:24,dim=c(3,4,2)) #각 행,열,레이어별 최댓값구하기




### 3. 리스트:구성원이 다른 벡터(atomic)의 한 종류, recursive=T


#name='kkangwook',id=20161434,order=c(1,2)정보로 mylist만들기
#name='kkangwook' 리스트만 꺼내오는 인덱싱 두가지 방법
#'kkangwook' 문자만을 가져오는 인덱싱 세가지 방법
# 2 만 뽑아오는 인덱싱의 인덱싱 3가지 방법
# mylist의 1,2번 리스트 동시에 가져오기(2가지)->1,3번 동시에 가져오기(2가지 방법)
#구성원소 id=20161435로 변경하기
# birth=19970528추가하고 삭제하기
#4~6번에 각각 a,b,c 요소 하나씩 추가하기
# 4~6번 태그 이름짓은 후 한꺼번에 4~6삭제하기
#한 줄에 여러개의 태그와 요소 같이 넣기 list: A=a,B=b,C=c

#태그 없이 'kkangwook',20161434,c(1,2)로 리스트 mylist2 만들어 보고 특징
#인덱싱 방법
# 1,2,3으로 이름 붙이기

#재귀리스트-mylist에 new라는 태그안에 list('hello',c(1,3,2))생성하기
#hello꺼내기->3꺼내기

# mylist 리스트를 작은리스트화->아예 비리스트화

# mylist와 mylist2 합치는 함수

#리스트나 벡터에 함수 일괄적용시켜주는 함수 두가지
x <- list(1:4,1:10) #에 대해 각각 평균 구하기

# 반복수행해서 리스트화 시키는 함수
#위 함수를 이용해 각 벡터들의 최댓값의 위치 찾기




### 4. 데이터프레임=구성요소가 다른 타입의 행렬


name <- c('kkangwook','bomi'); birthmonth <- c(5,4) #얘네들로 my_df데이터프레임 생성
# c('kkangwook','bomi')와 c(5,4)만으로 열 이름있는 my_df2 만들기
# 위를 이름없이 만든다음 행과 열 각각 이름 지어주기

# examscore.csv 읽어 mydata로
#인덱싱->midterm꺼내오는 4가지 방법
# ㄴ $,[],[[]],[,3]
# 2~4열 가져오기
# 2열의 1~4번째 행 가져오기->차원축소 끄기
# 2,3열의 3~10번째 행 가져오기
# midterm이 40점 이하인 아이들만 가져오기
# midterm이 40점 이하이지만 final은 40점 이상인 애들 데려오기

#total이라는 중간+기말 점수 추가하기 두가지 방법
#total 데이터 제거하기 두가지 방법
#30번 학생 중간고사 점수 60으로 변경하는 두가지 방법

#데이터에서 컨디션을 만족하는 부분만 뽑아내는 함수
#위 함수로 중간고사 30~60사이인 아이들만 뽑아내기

#데이터 프레임 합치기 함수
mydata2 <- data.frame(id=sample(1:30,5),result=c(rep('pass',3),rep('fail',2)))
#mydata에 합치고->30개 자료 다 볼 수 있는 옵션

#길이 30짜리 카테고리컬 변수 만들기
#final이 50이상이면 pass, 아니면 fail->mydata에 합치기

#펭귄데이터셋 꺼내기
#콘솔창에서 프린트 되는 개수 늘리는 함수
#중복을 없애고 펭귄의 유일한 종 값들만 보기
#아델리 펭귄 수컷 평균 몸무게는?
#subset과 파이프 연산자를 이용해 위의 답 구하기
#작은거에서 큰거로 정렬시키는 함수와 이를 이용해 작은 몸무게부터 큰몸무게로 정렬
#조건에 따른 함수를 적용시켜 보여주는 함수
#종 별, 성 별에 따른 평균 몸무게 
#종별 성별 몸무게 평균, 부리길이 평균은?
#종별 성별 모든 수치 데이터 평균은?

#aggreagte과 비슷하면서 NA값도 보여주는 함수
#위 방법을 사용하여 펭귄 종별 부리길이 평균 보기
#펭귄의 종 별, 사는곳 별 부리길이 평균  두 함수 다 사용하고 차이 보기

#매번 data$할 수 없으므로 생략할 수 있게끔 해주는 함수
#이를 사용하여 펭귄의 종 별, 사는곳 별 부리길이 평균 tapply로 다시 구해보기

# 함수를 직접 짜줘서 넣어 함수에 적용시키는 함수
#종별 부리길이와 부리높이의 상관계수 구하기(use='complete.obs)




### 5.팩터=범주형 변수를 다루는 도구


x <- c(1,13,5,2,1) #로 x_factor의 팩터만들기
# 범주를 c(1,2,3)으로 해서 만들어 보고 결과보기
# spring summer만 들어있는 계절변수 season만들기
# 1번을 winter로 변경
# 1번을 may로 변경
# 새로운 autumn추가
# autumn제거
# levels를 a,b,c,d로 변환
con_vector <- c('bad','good','soso','good') #에 대해 순서적용한 팩터만들기

#levels로 나눠 리스트화 하는 함수
x <- c(1,13,5,2,1) #를 리스트화하기




### 6.함수루프


#줄바꿈 역할을 하는 기호

#함수에서 입력값이 무엇인지 내용이 무엇인지 보여주는 함수, 전부보는법은?
#input이 없는 경우와 입력값이 정해진 경우 만들어보기
# abs함수로 early return함수 만들어 보기
#밖에 지정된 변수를 내부에서 쓸 수 있도록 하는 연산자

#if문 구조는?
# 5보다 클때 a, 5일때 b, 5보다 작을때 c를 출력하는 if문 만들기
#if문을 간략화하여 참이거나 거짓일때 해당 값을 반환하는 함수
# 조건이 3개 이상일때 good->g,normal->n,bad->b가 출력되도록
#함수안에 switch넣어 벡터와 input을 받아 평균,중앙값,표준편차중 하나를 반환하는 함수만들기

#for 문으로 1에서 30중 홀수만 출력

#while문-i=0에서 20까지 증가시키며 i print하다가 20되면 중단




### 7.문자열과 정규표현식


# hometown.txt 가져오기
# 길이와 문자개수세는 함수- 고향 시에서 가장 길이가 긴 행은 어디일까?
# 3,6번째 줄 뽑기
# 데이터에 내가 원하는 단어가 어디에 있는지 보여주는 함수->아버지 있는 줄만 출력

#문자열을 이어주는 함수 2종류와 차이
# 1st 2nd 3rd 4th 5th 이어붙여 만들기
# 옵션 2가지 1.1,3번째 줄 ','로 잇기   2. 벡터1~6줄 ','로 잇기

#문자열의 부분을 가져오는 함수->6번째줄 마지막 4글자 가져오기

#문자열을 나눠 리스트화 함수
#3번째 줄 공백으로 나눠 리스트화 하기->'앓아' 만 뽑기

#특정문자 바꿔주는 함수->띄어쓰기 없애기
#6번줄 한자 없애기-> |>심화:|>사용하여 6번줄 한자 없애가

#정규표현식
x <- c(statistics.playbook, statistics?playbook) # 각각 '.','?'한번에 제거하기
# stat.123에서 숫자만 제거하기->문자만 제거하기
gsub('.','','stat슬기로운.123') #이렇게 하면 어케될까?->'.'만 지우는 방법은?
x <- c("123-123","123.123","123*123","123!123") #에서 .or*가 들어있는 애들 가져오기
x <- c("슬기로운.통계생활", "슬기로운*PlayBOOK") #에서 '슬기로'만 제거하기

#맞는 패턴이 있는지 확인하는 함수와 그것을 통해 무엇이 맞는지 확인하는 함수
ex_str <- c("Mr. 슬통", "Mr 마통","Ms. Lee", "Mr. R",'Mr.R')
# Mr.만 뽑기-> Mr. or Mr 만 뽑기->Mr or Ms이면서 '.'이 있거나 없거나
#앞에 글자부터 뒤에 띄어쓰기 되어있는 애들만 뽑기
#이름이 한글만 뽑기->이름이 영어만 뽑기
# Mr. 슬통, Mr 마통만 가져오기

#고향 한자 다 없애고 새로운 txt파일 만들어 안에 쓰기
# \n넣으면서 한줄로 바꾸고 한자 제거 후 파일 만들고 안에 쓰고 파일 닫음




### 8. 데이터 스크래핑-쓰는 크롬 프로그램은과 R패키지는?


#transfermarkt.com->most valuable player 사용, 스크래핑 가능한지 여부를 보는 url은?
# 웹 읽는 함수는?-> 웹의 selector gadget 부분이 들어가는 함수는?
#->원하는 내용을 뽑아오는 함수는?->바깥 태그 벗기는 함수는?->속성부분을 띄어오는 함수는?
#이름, 나이(숫자), 국가(하나만),클럽,value(숫자부분만) 스크래핑
#원하는 문자만을 추출하는 패키지와 함수는?
#각각 함수로 만들어 1~5페이지 정보 전부 스크래핑 후 데이터프레임화
#이 데이터를 csv파일로 만드는 함수




### 9. 시각화


x <- 1:10; y <- x^2 #로 산점도 그리기
# 점찍는 함수(색,크기)와 직선 함수(3가지옵션)->점으로 직선그리기 1:10,1:10 

#아무것도 없는 평면만들기->x범위 30~60, y범위12~22, 제목=펭귄,x축-부리길이,
# y축-부리깊이, 제목,축,범위 글자 크기=1.5, 비율1로하는 옵션
# 펭귄 점찍기->종에 따라 색,점종류 다르게, 점크기=0.5
#범례함수->평면에 각 종별 평균인 곳에 종이름 적기
# 제목이나 바깥 구간에 주석 쓰는 함수+오른쪽이나 왼쪽 정렬




### 통계 시각화


#examscore로 원형차트 만들기, 원형차트 특징->제목, 각 정보 이름 설정
#각 구간 중앙에 퍼센트 표현

#줄기 잎 그래프->examscore의 midterm사용->확대 축소 옵션

#하나의 데이터 쓸때 가장 많이 쓰는 형태->midterm을 표시
# 범위 지정 옵션, 수가 아닌 확률로 나타내게 하는 옵션

#anova에 많이 쓰이는 형태
# midterm, final나타내는 두가지 방법
#이름 지정하기옵션, 눞이기 옵션
#각 분위들의 의미, 상자의 의미

#scatter plot은 위에서




### 통계1


#평균, 중앙값 함수-> 평균의 기호는?
# X_bar            평균,중앙값중 극단적인 값에 더 민감한 값은?
#평균              분포에서 skew to right와 left의 의미는?
#right:왼쪽이 큼(중앙값<평균), left는 반대          분포의 퍼짐을 보여주는 지표 두가지?
# IQR과 분산(표준편차)             분산과 표준편차 함수는?
#var(), sd()   
x <- rep(5,10); y <- c(1:10); z <- c(3,4,5,6,7,4,5,6,5,5) #각 분산과 퍼짐의 관계는?
#어떤 데이터에 대한 대략의 정보를 보여주는 함수




### 통계 2


#상관계수란? 쓰는 함수는? r이 가능한 범위는? 그림에 따른 r의 예측은?
#examscore.csv의 midterm과 final상관계수 구하기->p-value는 유의한지?
#cor.test




### 통계 회귀분석-회귀분석이란?


#독립변수에 따라 종속변수의 변화를 예측하는 선형모델      회귀직선에 주요요소는?
#rss가 최소가 되어야 함                     어떤 함수의 최솟값을 구해주는 함수는?
#optim()                              3d로 보여주는 패키지와 사용법은?
#rgl->open3d()->persp3d(vrss)->rgl.sphere         회귀직선의 a,b값 식은?
b=cor(x,y)*sd(y)/sd(x); a=mean(y)-b*mean(x)     #a=절편, b=기울기

#회귀직선 함수와 examscore에서 midterm에 따른 final예측하여 회귀직선구하기
#중간에 40점 받았는데 기말은 몇점 받을지 예측하는 함수

#다중회귀분석-여러 연속형 독립변수로 하나의 종속변수 예측
#mtcars의 wt,disp,hp,drat로 mpg예측하려함
#5*5의 상관계수 보여주는 패키지와 함수
# 함수 이용하여 실제 다중회귀직선 구하기->각각 p-value도 보기
#표준화 방법
pre <- data.frame(hp=c(150,170),wt=c(2.5,3),disp=c(250,300),drat=c(3.3,3.5))#예측하기
# 옵션으로 신뢰구간 보이는 법




#통계 정규분포


#잡음이란?  일정하거나 규칙이 있으면 잡음인가?
#아니다                그러면 무엇이 잡음인가
#랜덤해야 한다          쓰는 함수 두가지는?
#runif, rnorm-옵션들은?          rnorm을 뽑았을때 가능도 함수는?
#dnorm                           정규분포의 요소 두가지는와 표현방법은?
# 평균, 분산(표준편차), N(뮤,시그마^2)          #a-b-c규칙에 들어갈 숫자는?
#68(평균+-표준편차)-95(평균+-표준편차*2)-99.7(평균+-표준편차*3)
# 평균 10 표준편차 4의 정규분포 그려보기
# rnorm, dnorm외의 두가지 함수와 옵션중 이하일경우->이상일 경우로 바꾸는 옵션

#학생들의 중간고사 점수가 정규분포 N(10,2^2)을 따름, 나의 점수는 12점, 학생수는 1000명
#1.시험점수 10~14점 사이인 학생은 대략 몇 명? 475
#2 나보다 시험점수가 낮은애들은 몇명? 840
#3 시험점수가 8점~14점 사이 학생 수는? 815
#4 학생들의 시험점수 분포의 IQR은 4보다 클까? IQR=2.697959

#정규분포 표준화 하는 법 그리고 표준화 하면 어떤 정규분포랑 비교해야하는지
#실제 값을 평균으로 빼고 표준편차로 나눔->N(0,1)과 비교
#한국지리~N(80,5^2) 범과정치~N(75,6^2)보미=한국지리 77점, 이삭=법과정치 74점->대학교는 둘중 누구를 뽑아야할까?
#표준화 해도 되지만 그냥 pnorm,qnorm쓰면 됨
#예제1-1숙제점수~N(10,2^2), 학생수=75, 나(12점)보다 낮게 받은 학생수는?
#예제1-2 보미는 상위 8퍼에 듬, 보미의 성적은?

#대수의 법칙이란?
#많은수를 뽑을수록 뽑은 애들 평균이 실제 평균에 가까워짐     전체와 일부를 통계언어로?
# 모집단-모수, 표본-난수            표본n개를 뽑았을때 평균이 따르는 분포는?
#N(µ,σ^2/n)를 따름(평균 같고 표준편차는 sqrt(n)으로 나눔)   몇명이상 뽑아야 정규로인정?
#30명 이상

#예제-수능 수학점수 평균=60, 표준편차=8, 3등급컷은 74점
#1. 랜덤하게 뽑은 '한' 학생의 수학점수가 74점 이상일 확률?-4%
#2. 랜덤하게 '50'명 뽑았을때 '50명의평균'수능점수분포 그려서 비교  N(60,1.131)
#3. 50명학생들의 평균 수능점수가 74점 이상일 확률은? 거의 0




### 통계 검정-귀무가설과 대립가설은?


#귀무가설:변화없다 대립가설:변화있다            귀무가설 기각 위한 정보는?
#p-value가 0.05보다 작을수록 대립체택증가      양측검정vs단측검정은?
#양측=같다vs다르다, 단측=같다vs크다or작다

#집단 2개일때 사용하는 검정과 그 3가지 종류+주로 보는 시각화는
# boxplot-각 경우마다 한번씩 보기
#일표본t-test-모집단 평균하고 그 모집단에서 뽑은 표본의평균하고 비교      조건은?
# 30이상이거나 10~29더라도 정규성                 정규성 test는?
#shapiro.test()                             둘다 만족하지 못하면?
#wilcox.test
sample <- rnorm(30,mean=38,sd=3); m=30 #모집단 평균=30으로 비교+양측/단측3가지

#독립표본t-test                         조건은?
#30이상, 10~29면 shapiro.test, 이후 분산이 같아야 함 ->이함수의 패키지와 함수는?
#lawstat과 levene.test                          등분산이거나 아니면 옵션은?
# var.equal=T or F
male_h <- rnorm(40,170,5);female_h <- rnorm(40,160,5) #등분산 후 두가지 방식으로
# 조건 만족못하면 wilcox.test()

# 대응표본 t-test: 변화 비교                       조건은?
# 두 집단 종속관계이며 + 표본 크기 30이상 or 10~29이면서 정규분포->아니면 wilcox.test
before <- rnorm(40,100000,15000);after <- before+rnorm(40,3,2) #로 t-test하기


## 집단이 세개이상일때의 평균 비교방법은?
# anova                        종속변수1개 vs종속변수 여러개일때쓰는 함수는?
# aov()  manova()              종속변수1개, 독립변수1개, 집단 3개이상일때?
#일원분산 분석                           조건은?
#각 그룹이 서로 독립, 각각 정규분포를 따름, 각 분산이 동일해야함
# R_OneWay_ANOVA.xlsx 파일 읽어 데이터화 ->반에 따른 점수에 차이가 있나?
# 정규성, 등분산 확인->일원분산분석 진행->p-value값도 확인
#사후분석 진행으로 어떻게 다른지 확인

#이원분산분석 
dt_df$gender <- rep(c('male','female'),45) #2독립변수로 관계확인
# p-value와 사후분석

#다원분산분석
dt_df$age <- rep(c('old','old','young','young','old','young'),15) #똑같이 진행


##다변량분산분석 iris데이터 사용
# 종에 따른 Sepal.Length와Sepal.Width 차이 있는지
#종에 따른 Sepal.Length,Sepal.Width,Petal.Length,Petal.Width 차이 있는지
iris$gender <- sample(c('M','F'),150,replace = T)
#종과 성별따라 Sepal.Length,Sepal.Width,Petal.Length,Petal.Width 차이 있는지


##카이제곱검정                      특징
#독립변수와 종속변수 둘다 범주형 데이터,  비율을 봄
#성별에 따른 공포영화 선호도에 차이가 있나?
r1 <- c(70,50)  ;r2 <- c(30,50)
data <- rbind(r1,r2) #matrix형태
colnames(data) <- c('male','female'); rownames(data) <- c('prefer','dislike')
#data로 카이제곱검정 진행, 교정은 F로